[
    {
        "name": "Cheesy Vegan Loaded Potato Stacks",
        "description": "These delectable Cheesy Loaded Potato Stacks are the mini version of a loaded baked potato. Melty cheese is nestled between layers of thinly sliced potatoes then drizzled with melted butter and baked to golden, crispy perfection! Top the stacks with classic loaded baked potato toppings – sour cream, bac’n bits, and chives! Serve as fun appetizer, delicious side dish, or party appetizer!",
        "url": "https://www.eatfigsnotpigs.com/cheesy-vegan-loaded-potato-stacks/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2022/02/Cheesy-Loaded-Potato-Stacks_0915-683x1024.jpg",
        "ingredients": [
            "2 pounds starchy potatoes, such as russet",
            "2 teaspoons kosher salt",
            "1 teaspoon baking soda",
            "¼ cup melted vegan butter",
            "1 teaspoon garlic powder",
            "1 teaspoon onion powder",
            "1 teaspoon smoked paprika",
            "½ teaspoon salt and ground black pepper",
            "1 ½ cups vegan cheddar cheese shreds",
            "Vegan sour cream, for garnish, optional",
            "Vegan bac'n bits, for garnish, optional",
            "Thinly sliced chives, for garnish, optional"
        ],
        "instructions": [
            "Slice the potatoes thinly into 1.5mm slices using a mandolin or sharp knife.",
            "Place the rounds into a large bowl and sprinkle in the salt and baking soda.",
            "Fill the bowl with enough cold water so that it covers the potatoes by an inch or so.",
            "Using your hands, give it a gentle mix to combine. Set aside to soak for 10 minutes. Drain and pat the rounds dry.",
            "Place the potatoes back into the same bowl that you soaked them in.",
            "Season with the melted butter, garlic powder, onions powder, smoked paprika, salt and pepper.",
            "Toss to combine, ensuring the potatoes are thoroughly coated in seasoning.",
            "Meanwhile, preheat your oven to 350°F.",
            "Grease a cupcake tin generously with olive oil.",
            "Stack the potato rounds into each cupcake slot, layering with about 2 teaspoons of cheddar shreds every couple of layers.",
            "Continue stacking until each slot is full, making sure the last layer is not topped with cheese. Reserve some cheese shreds for later.",
            "Cover the cupcake tin loosely with tin foil and bake until the potatoes are cooked through, 45 to 50 minutes. A small sharp knife or toothpick should go through with no resistance.",
            "Remove the foil – if cheese is oozing out and the stacks are sinking a bit, that’s okay! Simply reposition them as best you can! And the crispy bits of cheese oozing out are the best part!",
            "Sprinkle the remaining cheese shreds on top of each stack and return to the oven uncovered.",
            "Bake until golden and crispy, about 10 to 15 minutes. If you’d like, you can broil them for the last 5 minutes or so—just keep an eye on them to prevent burning!",
            "Remove from the oven and let cool for 10 minutes. Garnish each stack with sour cream, bac’n bits, chives, and flaky salt. Enjoy!"
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "Appetizers",
            "Game Day Snacks",
            "Potato",
            "Quick and Easy",
            "Side Dishes"
        ],
        "id": "0"
    },
    {
        "name": "Chick’n Caesar Pasta Salad",
        "description": "This Chick’n Caesar Pasta Salad is a fun twist on the typical Caesar and pasta salads, combining the best of both worlds! Loaded with creamy dressing, seasoned vegan chick’n, and peppery arugula, then topped with homemade lemon-garlic breadcrumbs, this pasta salad is full of texture and bursting with flavor in every bite! Serve as a side dish or enjoy it for lunch or dinner! It’s the perfect summer recipe!",
        "url": "https://www.eatfigsnotpigs.com/chickn-caesar-pasta-salad/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2022/06/Chickn-Caesar-Pasta-Salad_1280-2-1024x768.jpg",
        "ingredients": [
            "½ cup raw cashews (see recipe note 1)",
            "2 tablespoons vegan mayonnaise",
            "2 tablespoons fresh lemon juice",
            "2 tablespoons nutritional yeast",
            "1 tablespoon Dijon mustard",
            "1 tablespoon olive oil",
            "3 cloves fresh garlic",
            "2 teaspoons rinsed capers",
            "1/2 teaspoon Kosher salt, plus more to taste",
            "1/2 teaspoon fresh ground black pepper, plus more to taste",
            "1 tablespoon olive oil",
            "1 cup panko breadcrumbs",
            "1 teaspoon garlic powder",
            "½ teaspoon salt, plus more to taste",
            "½ teaspoon pepper, plus more to taste",
            "½ teaspoon chili flakes",
            "Zest of 1 lemon",
            "12 ounces short pasta noodles, such as penne or cavatappi",
            "5 ounces baby arugula",
            "8 ounces prepared vegan chick’n (see recipe note 2 for tofu shredded chick’n recipe)",
            "1 cup caesar dressing",
            "1 cup thinly sliced red onion",
            "1 cup lemon-garlic breadcrumbs",
            "Vegan parmesan shreds, for garnish, optional"
        ],
        "instructions": [
            "Place the cashews, mayo, lemon juice, nutritional yeast, Dijon, olive oil, garlic, capers, and ½ cup of water in a high-powered blend and pulse until smooth. ",
            "Taste and adjust seasonings, if necessary.",
            "If you want a thinner consistency, add more water 2 tablespoons at a time until you reach your desired consistency. Set aside.",
            "In a pan on medium heat, add the olive oil. Once the oil is hot, add the breadcrumbs, season with the garlic powder, salt, pepper, and chili flakes, and cook, stirring often, until it reaches a nice golden-brown color, 7 to 10 minutes. ",
            "Off the heat, stir in the lemon zest until fully incorporated. Taste and adjust seasonings, if necessary.",
            "Cook the noodles in a large pot of salted water according to package directions, until al dente. Drain, but do not rinse. Place the noodles in a large bowl and set aside to cool at room temperature.",
            "Once slightly cooled, add the arugula and vegan chick’n pieces to the bowl with the pasta and toss with the Caesar dressing until everything is even;y coated.",
            "Place in the refrigerator for at least an hour to chill.",
            "When ready, garnish the pasta salad with thinly sliced red onions, lemon-garlic breadcrumbs and vegan parmesan. Enjoy!"
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "4th of July",
            "Appetizers",
            "Backyard BBQ",
            "Labor Day",
            "Lunch",
            "Mains",
            "Memorial Day",
            "Pasta",
            "Salads",
            "Side Dishes",
            "Spring/Summer",
            "Tofu"
        ],
        "id": "1"
    },
    {
        "name": "Creamy One Pan Cajun-Inspired Tofu",
        "description": "This Creamy One Pan Cajun-Inspired Pasta with Crispy Tofu is the kind of weeknight dinner you’ll want on repeat. It’s rich, smoky, and just the right amount of spicy, loaded with tender veggies, pasta, and crispy golden tofu—all simmered together in a luscious Cajun-spiced cream sauce. And the best part? It all comes together in a single pan for easy cleanup and maximum flavor.",
        "url": "https://www.eatfigsnotpigs.com/creamy-one-pan-cajun-inspired-tofu/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2025/06/One-Pan-Cajun-Inspired-Pasta_0384-1024x683.jpg",
        "ingredients": [
            "1 16-ounce block of super firm tofu, cubed (or extra firm tofu, pressed, drained, and cubed)",
            "2 tablespoons cornstarch",
            "2 tablespoons teaspoons Cajun seasoning, divided (homemade or store-bought)",
            "3 tablespoons olive oil, divided",
            "1 white onion, diced",
            "2 stalks celery, diced",
            "1 jalapeno, deseeded and diced",
            "8 cloves fresh minced garlic",
            "2 tablespoons nutritional yeast",
            "1 teaspoon chili flakes, optional",
            "12 ounces short pasta noodles, such as penne or bowtie",
            "1 14.5 oz can diced fire-roasted tomatoes, with their juice",
            "¼ cup fresh minced parsley, plus more for garnish",
            "3 cups vegetable broth",
            "1 cup vegan heavy cream",
            "1 large yellow bell pepper, thinly sliced",
            "1 large red bell pepper, thinly sliced",
            "¾ cup vegan parmesan, plus more for garnish",
            "¼ fresh lemon juice",
            "Salt and pepper, to taste",
            "Fresh minced chives, for garnish"
        ],
        "instructions": [
            "To prepare the tofu, toss the tofu with the cornstarch and 1 tablespoon of the Cajun seasoning until evenly coated.",
            "Heat 2 tablespoons of the olive oil in a large sauté pan over medium heat.",
            "Once the oil is hot, pan fry the tofu until golden brown and crispy, 8 to 10 minutes. Remove and set aside.",
            "Heat the remaining tablespoon of oil in the same sauté pan over medium heat.",
            "When the oil is hot, add the onion, celery, and jalapeno. Cook, stirring often, until the onion is translucent and the peppers are slightly tender, 5 to 6 minutes.",
            "Stir in the garlic and cook for another 1 to 2 minutes.",
            "Season with the remaining tablespoon Cajun seasoning, nutritional yeast, and chili flakes (if using). Continue to cook, stirring often, to bloom the spices, 1 to 2 minutes.",
            "Add the uncooked pasta, diced tomatoes with their juices, parsley, broth, heavy cream, and thinly sliced bell peppers.",
            "Stir to combine and bring to a boil.",
            "Once at a light boil, reduce the heat to low, cover and simmer, stirring occasionally, until the pasta is al dente and the liquid has reduced into a creamy sauce, 12 to 15 minutes.",
            "Add the parmesan and stir until it has melted throughout.",
            "Stir in the reserved tofu and lemon juice until everything is combined. Taste and adjust seasonings, if necessary.",
            "Serve immediately with more vegan parmesan and fresh chives. Enjoy!"
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "Lunch",
            "Mains",
            "One and Done",
            "One-Pot + One-Skillet",
            "Pasta",
            "Quick and Easy",
            "Tofu"
        ],
        "id": "2"
    },
    {
        "name": "Creamy Southern-Style Potato Salad (Vegan)",
        "description": "This creamy Southern-Style Potato Salad is inspired by the cookouts and family gatherings I grew up with, and an ode to my time living in Louisiana, where no get-together was complete without a big bowl of creamy potato salad on the table. With smoky spices, a little heat, and that signature eggy flavor, this dish is a true celebration of Southern comfort!",
        "url": "https://www.eatfigsnotpigs.com/creamy-southern-style-potato-salad-vegan/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2025/06/Southern-Style-Potato-Salad_0375-1024x683.jpg",
        "ingredients": [
            "3 pounds russet potatoes, peeled and cut into 1”-inch cubes",
            "1 tablespoon kosher salt",
            "1 cup vegan mayonnaise",
            "⅓ cup yellow mustard",
            "¼ cup sweet pickle relish",
            "¼ cup fresh minced parsley",
            "1 tablespoon Louisiana hot sauce, such as Tabasco or Crystal Hot Sauce",
            "2 teaspoons black salt, also known as Kala Namak, plus more to taste",
            "1 ½ teaspoons smoked paprika, plus more for garnish",
            "1 teaspoon fresh cracked black pepper, plus more to taste",
            "½ teaspoon garlic powder",
            "½ teaspoon onion powder",
            "½ teaspoon celery seed",
            "8 ounces super firm tofu, diced",
            "1 small Vidalia onion, diced",
            "3 stalks celery, diced",
            "¾ cup dill pickles, diced",
            "Minced chives, for garnish, optional"
        ],
        "instructions": [
            "Place the cubed potatoes and kosher salt in a large pot or Dutch oven and fill the pot with enough cold water to cover the potatoes by about an inch.",
            "Cover the pot with a lid and bring to a boil over high heat.",
            "Once at a boil, remove the lid, reduce the heat to medium, and continue to simmer until the potatoes are just tender, 13 to 15 minutes.",
            "Once the potatoes are tender (you should be able to pierce them with a fork, but there should be a slight resistance), drain and let cool at room temperature for 10 to 15 minutes.",
            "Transfer the potatoes to the same pot that you boiled them in, then using a potato masher, gently mash the potatoes 4 to 5 times – you still want some chunks!",
            "While the potatoes are boiling, whisk together the mayonnaise, mustard, sweet pickle relish, parsley, hot sauce, black salt, pepper, smoked paprika, garlic powder, onion powder and celery seed in a large bowl.",
            "Fold in the diced tofu, onion, celery, and pickles until coated in the sauce.",
            "Add the potatoes to the same bowl, mixing to combine with the rest of the ingredients.",
            "Taste and adjust seasonings, if necessary.",
            "Cover and refrigerate for 2 to 4 hours.",
            "Serve chilled and garnish with a sprinkle of smoked paprika and chives. ENJOY!"
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "4th of July",
            "Backyard BBQ",
            "Holiday",
            "Labor Day",
            "Memorial Day",
            "Potato",
            "Quick and Easy",
            "Tofu"
        ],
        "id": "3"
    },
    {
        "name": "Black Bean Mushroom Burgers",
        "description": "Smoky, hearty, and packed with umami, these Black Bean Mushroom Burgers are a plant-based spin on a classic that even meat-lovers will love! Made with simple and affordable ingredients, they’re easy to prep, grill like a dream, and hold their shape beautifully. Whether you’re serving them up at a summer BBQ or meal-prepping for the week, these burgers deliver big flavor in every bite.",
        "url": "https://www.eatfigsnotpigs.com/black-bean-mushroom-burgers/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2025/05/Black-Bean-Mushroom-Burgers_0366-683x1024.jpg",
        "ingredients": [
            "1 tablespoon olive oil",
            "8 oz cremini mushrooms (or mushrooms of choice), finely chopped",
            "1 small white onion, diced",
            "1 teaspoon salt, divided, plus more to taste",
            "1 teaspoon pepper, divided, plus more to taste",
            "6 cloves fresh minced garlic",
            "1 15-ounce can black beans, drained",
            "1 cup rolled oats",
            "1 tablespoon soy sauce",
            "1 tablespoon nutritional yeast",
            "1 teaspoon smoked paprika",
            "1 teaspoon garlic powder",
            "½ teaspoon ground cumin",
            "¼ teaspoon MSG, optional",
            "Hamburger buns, for serving",
            "Preferred Burger fixings, for serving"
        ],
        "instructions": [
            "Heat the olive oil in a large sauté pan over medium-high heat.",
            "Once the oil is hot, add the mushrooms and onion, and cook, stirring occasionally, until the moisture is gone and the mushrooms are slightly crisped around the edges, 10 to 12 minutes.",
            "Once most of the moisture has cooked out of the mushrooms, season with ½ teaspoon salt and pepper, add the garlic, and continue to cook for another 1 to 2 minutes.",
            "Remove from the heat and let it cool at room temperature for 5 to 10 minutes.",
            "Once the mushroom mixture is slightly cooled, place it in a food processor with the drained black beans, oats, soy sauce, nutritional yeast, smoked paprika, garlic powder, cumin, salt, pepper, and MSG (if using).",
            "Pulse for about 20 to 30 seconds, until the mixture is thoroughly combined, but not pureed (you may need to push the sides down with a spatula).",
            "If the mixture seems too wet, add oats a few tablespoons at a time to thicken. If it seems to dry, add a couple splashes of water to thin it out.",
            "Form the black bean mixture into patties and place them on a parchment paper lined tray.",
            "Refrigerate for at least 30 minutes – this will help them firm up and hold their form for grilling or pan-searing!",
            "Preheat your grill to medium-high and brush the grates with oil.",
            "Grill burgers until heated through and crisp around the edges, 4 to 5 minutes per side.",
            "Serve on hamburger buns with desired fixings and enjoy!"
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "4th of July",
            "Back to School",
            "Backyard BBQ",
            "Burgers & Sandwiches",
            "Holiday",
            "Labor Day",
            "Lunch",
            "Mains",
            "Memorial Day",
            "Mushrooms",
            "Quick and Easy",
            "Spring/Summer"
        ],
        "id": "4"
    },
    {
        "name": "Sushi Bake Cups (Vegan)",
        "description": "These Vegan Sushi Bake Cups are a fun, handheld twist on the viral sushi bake trend, but made entirely plant-based! Packed with savory tofu, spicy mayo, and seasoned sushi rice, these bite-sized cups are baked to golden perfection for an easy, crowd-pleasing appetizer, snack, or light lunch! Whether you’re hosting a just craving sushi without the fuss, this recipe is sure to hit the spot!",
        "url": "https://www.eatfigsnotpigs.com/sushi-bake-cups-vegan/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2025/05/Sushi-Bake-Cups_0351-1024x683.jpg",
        "ingredients": [
            "1 ½ cups cooked sushi rice, or short grain rice",
            "3 tablespoons nori furikake rice seasoning, optional",
            "2 tablespoons seasoned rice vinegar",
            "¼ cup vegan mayonnaise",
            "2 tablespoons soy sauce",
            "2 tablespoons sriracha",
            "1 teaspoons sesame oil",
            "½ teaspoon salt, plus more to taste",
            "½ teaspoon pepper, plus more to taste",
            "1 16-ounce block of super firm tofu, diced",
            "Assembly and Garnishes:",
            "6 roasted seaweed sheets, cut into 4 squares each (you should have 24 squares)",
            "Spicy vegan mayo, toasted sesame seeds, thinly sliced avocado, and minced green onion, for garnish"
        ],
        "instructions": [
            "Preheat oven to 400°F.",
            "To make the rice, mix it with the nori furikake rice seasoning and rice vinegar, mixing to combine. Set aside.",
            "For the filling, whisk together the mayonnaise, soy sauce, sriracha, sesame oil, salt and pepper until combined.",
            "Fold in the diced tofu until it’s thoroughly coated in the sauce.",
            "Lightly grease a muffin tin and place 2 squares of nori in each cup – it’ll soften as it bakes.",
            "Spoon a couple tablespoons of rice in each of the cups and gently press down.",
            "Next, spoon 2 to 3 tablespoons of the tofu mixture into each cup and bake until the edges are slightly crisped and filling is golden, 20 to 25 minutes.",
            "Remove from the oven and cool at room temperature for 5 to 10 minutes.",
            "Garnish the cups with spicy mayo, toasted sesame seeds, avocado, and green onion. Enjoy!"
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "Asian Inspired",
            "Game Day Snacks",
            "Lunch",
            "Mains",
            "Quick and Easy",
            "Rice",
            "Tofu"
        ],
        "id": "5"
    },
    {
        "name": "Pea Pesto Bruschetta",
        "description": "Bruschetta is one of those amazing recipes that proves you can make a flavorful dish with good, simple ingredients in just a matter of minutes. It’s a classic favorite … and for good reason! My Pea Pesto Bruschetta combines classic tomato bruschetta with bright and vibrant pea pesto. The combination makes for a perfect, refreshing summer meal!",
        "url": "https://www.eatfigsnotpigs.com/pea-pesto-bruschetta/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2020/07/Pea-Pesto-Bruschetta-9438-683x1024.jpg",
        "ingredients": [
            "1 LB cherry tomatoes, diced",
            "½ cup red onion, minced",
            "2 tablespoons balsamic vinegar",
            "1 teaspoon Kosher Salt",
            "2 tablespoons olive oil",
            "1 cup peas",
            "½ cup fresh basil, plus more for topping",
            "¼ cup olive oil",
            "¼ cup nutritional yeast",
            "¼ cup pine nuts",
            "½ cup fresh mint",
            "4 cloves garlic",
            "1 tablespoon fresh lemon zest + 1 tablespoon fresh lemon juice",
            "1 teaspoon Kosher salt",
            "½ teaspoon red pepper flakes",
            "1 15 oz rustic loaf or baguette, cut into ½” slices",
            "Extra virgin olive oil, for brushing",
            "2-3 cloves garlic",
            "Balsamic glaze",
            "Thinly sliced basil"
        ],
        "instructions": [
            "To prepare the tomato topping, combine all the topping ingredients in a bowl and mix to combine. Taste and adjust seasoning, if necessary.",
            "Cover, set aside, and let marinate while you prepare the rest of the ingredients.",
            "Meanwhile, place all the pea pesto ingredients in a food processor or blender and pulse until smooth.",
            "Brush your sliced bread with a bit of olive oil and grill until crisp (if you don’t have a grill, you can use a cast iron skillet on the stovetop or toast the bread in the oven).",
            "When the bread is cool enough to touch, but still warm, rub the grilled side of the bread with the garlic.",
            "To assemble the pea pesto bruschetta, smear about 1 tablespoon of pea pesto on each slice of grilled bread. Follow with a large spoonful of the tomato topping and some of the marinating liquid. Finish with fresh basil and enjoy immediately!"
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "Appetizers",
            "Backyard BBQ",
            "Holiday",
            "Italian Inspired",
            "Labor Day",
            "Lunch",
            "Memorial Day",
            "Quick and Easy",
            "Side Dishes",
            "Spring/Summer"
        ],
        "id": "6"
    },
    {
        "name": "Old Bay Smashed Potato Salad",
        "description": "It’s officially grilling season, and if you ask me, no backyard BBQ is complete without a really good potato salad – and this Old Bay Smashed Potato Salad is just that! Baby potatoes are boiled until tender, smashed, and baked to golden, crispy perfection. Toss with crunchy veggies and zesty Old Bay dressing, and you’ve got a unique take on potato salad that is sure to be on heavy rotation this summer!",
        "url": "https://www.eatfigsnotpigs.com/old-bay-smashed-potato-salad/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2024/06/Old-Bay-Smashed-Potato-Salad_0017-1024x683.jpg",
        "ingredients": [
            "3 pounds baby potatoes",
            "Kosher salt, to taste",
            "Fresh cracked black pepper, to taste",
            "2 tablespoons olive oil",
            "1 cup vegan mayo",
            "1/2 cup sweet relish",
            "3 tablespoons apple cider vinegar",
            "1 tablespoon Old Bay Seasoning",
            "1 teaspoon celery seed",
            "1 cup diced celery",
            "1 cup thinly sliced red onion",
            "1/3 cup minced chives",
            "1/4 cup fresh minced parsley",
            "3 tablespoons minced dill, plus more for garnish"
        ],
        "instructions": [
            "Place the potatoes in a large pot, season with salt to taste, cover with water, and bring to a boil. Cook the potatoes until fork tender, but not too soft, 25-35 minutes. Drain and cool for 5-10 minutes.",
            "Meanwhile, preheat your oven to 425°F.",
            "Place the potatoes on a prepared baking tray. Using the bottom of a cup or the flat side of a spatula, gently smash the potatoes. Drizzle with the olive oil and season with a pinch of salt and pepper. Bake the potatoes until the edges are crispy and golden, 25-30 minutes. Remove and let cool for 5-10 minutes.",
            "While the potatoes are in the oven, place the mayo, relish, apple cider vinegar, old bay seasoning, and celery seed in a large bowl and whisk to combine. Place the smashed potatoes into the bowl along with the celery, red onion, chives, parsley, and dill. Toss gently to combine. Taste and adjust seasonings, if necessary.",
            "You can serve immediately, but I like to place mine in the refrigerator to cool for at least one hour to serve chilled."
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "4th of July",
            "Backyard BBQ",
            "Father's Day",
            "Labor Day",
            "Lunch",
            "Memorial Day",
            "Potato",
            "Salads",
            "Side Dishes",
            "Spring/Summer"
        ],
        "id": "7"
    },
    {
        "name": "One Pan Chick’n Enchilada-Inspired Skillet",
        "description": "This One Pan Chick’n Enchilada-Inspired Skillet delivers all the rich and saucy goodness of enchiladas — without the fuss! Made with protein-packed soy curls, hearty black beans, and a smoky spice blend, it’s a bold and satisfying one-skillet meal perfect for busy weeknights or laid-back weekends!",
        "url": "https://www.eatfigsnotpigs.com/one-pan-chickn-enchilada-inspired-skillet/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2025/05/One-Pan-Chickn-Enchilada-Inspired-Sklillet_0346-1024x673.jpg",
        "ingredients": [
            "2 teaspoons chili powder",
            "1 teaspoon kosher salt",
            "1 teaspoons garlic powder",
            "1 teaspoon onion powder",
            "1 teaspoon smoked paprika",
            "1 teaspoon Mexican oregano",
            "1 teaspoon ground cumin",
            "½ teaspoon cayenne pepper powder (optional)",
            "4 ounces dehydrated soy curls, about 2 cups",
            "4 tablespoons neutral oil, divided",
            "1 teaspoon salt",
            "1 teaspoon fresh cracked black pepper",
            "1 medium yellow onion, diced",
            "1 red bell pepper, diced",
            "1 4-ounce can fire-roasted diced green chilies",
            "6 cloves fresh minced garlic",
            "1 15-ounce can black beans, drained and rinsed",
            "8 6-inch tortillas, cut into eighths",
            "2 ½ cups enchilada sauce, homemade or store-bought",
            "1 cup vegan shredded Mexican blend cheese, room temperature",
            "1 cup sliced black olives (optional)",
            "Fresh minced cilantro, for garnish (optional",
            "Vegan sour cream, for serving (optional)",
            "Pickled jalapeno, for serving (optional)",
            "Thinly sliced avocado, for serving (optional)"
        ],
        "instructions": [
            "To make the seasoning mix, combine all the ingredients in a small bowl and set aside.",
            "Soak the soy curls in boiling hot water for 8 to 10 minutes.",
            "After the soy curls have soaked, drain and squeeze out the excess moisture through a fine-mesh sieve or cheesecloth.",
            "Next, heat 2 tablespoons of the oil in a large sauté pan over medium-high heat.",
            "Once the oil is hot, add the rehydrated soy curls, season with 1 teaspoon salt and pepper and cook, stirring occasionally, until the soy curls start to crisp on the edges, 8 to 10 minutes.",
            "Transfer the soy curls to a plate and set aside.",
            "In the same skillet, heat the remaining 2 teaspoons of oil over medium heat.",
            "Once the oil is hot, add the onions, red bell pepper, green chilies and cook, stirring occasionally, until the onion is translucent, 3 to 5 minutes.",
            "Add the garlic and sauté another 1 to 2 minutes.",
            "Stir in the black beans and reserved soy curls, and season with the reserved seasoning blend.",
            "Add the tortilla pieces and pour in the enchilada sauce, stirring to coat everything in the sauce.",
            "Bring the mixture to a simmer, then reduce heat to low and cover.",
            "Continue to simmer, covered, until the tortillas are tender and saucy, 10 to 12 minutes.",
            "Remove the lid, sprinkle the cheese over the top, and spread the olives in an even layer (if using).",
            "Place the lid back onto the skillet and continue to simmer until the cheese is melty and bubbly, 5 to 7 minutes.",
            "Top with fresh minced cilantro and serve with vegan sour cream, pickled jalapeno and avocado. ENJOY!"
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "Lunch",
            "Mains",
            "Mexican Inspired",
            "One and Done",
            "One-Pot + One-Skillet",
            "Quick and Easy",
            "Tex-Mex"
        ],
        "id": "8"
    },
    {
        "name": "One Pan Marry Me Tofu and Orzo",
        "description": "This delicious Marry Me Tofu and Orzo is a one-pan meal that is sure to impress! It’s creamy, rich, and full of flavor—perfect for a romantic dinner (you might get proposed to after your date tries this dish, so be warned!)  or just treating yourself!",
        "url": "https://www.eatfigsnotpigs.com/marry-me-tofu-and-orzo/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2025/02/Marry-Me-Tofu-and-Orzo_0197-1024x683.jpg",
        "ingredients": [
            "3 tablespoons olive oil, divided (I used the oil from a jar of sun-dried tomatoes)",
            "1 (16-ounce) block of super firm tofu, cubed (or extra firm tofu, pressed, drained, and cubed)",
            "2 tablespoons cornstarch",
            "1 teaspoon garlic powder",
            "1 teaspoon smoked paprika",
            "½ teaspoon salt and pepper",
            "1 small white onion, diced",
            "½ cup sun dried tomatoes, drained and chopped",
            "6 cloves garlic, thinly sliced",
            "2 teaspoons Italian seasoning",
            "½ teaspoon red chili fakes ",
            "1 cup uncooked orzo",
            "2 cups vegetable broth",
            "1 cup vegan heavy cream",
            "1 cup vegan parmesan shreds, plus more, for garnish",
            "4 cups loosely packed spinach",
            "Fresh minced parsley or basil, for garnish, optional"
        ],
        "instructions": [
            "To prepare the tofu, toss the tofu cubes with cornstarch, garlic powder, smoked paprika, salt, and black pepper until evenly coated.",
            "Heat 2 tablespoons of the olive oil in a large sauté pan over medium heat and pan-fry the tofu until golden brown and crispy, about 8-10 minutes. Remove and set aside.",
            "Heat the remaining tablespoon of olive oil into the pan.",
            "Once hot, add the onion and sundried tomatoes. Cook, stirring often, until the onion is translucent, 5 to 6 minutes.",
            "Add the garlic and Italian seasoning, and sauté another 1 to 2 minutes.",
            "Next, add the orzo and toast for 1 to 2 minutes, stirring often, until lightly golden.",
            "Pour in the broth, heavy cream, and parmesan.",
            "Mix to combine and increase the heat to high.",
            "Once at a light boil, reduce the heat to low, and simmer, stirring every few minutes, until the orzo is cooked through and the mixture has thickened, 12-15 minutes.",
            "Add the crispy tofu back into the pan, tossing to combine.",
            "In batches, toss the spinach in and continue to cook just until it’s wilted, 1 to 2 minutes.",
            "Serve immediately with more vegan parmesan and minced parsley. Enjoy!"
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "Italian Inspired",
            "One and Done",
            "One-Pot + One-Skillet",
            "Quick and Easy",
            "Tofu"
        ],
        "id": "9"
    },
    {
        "name": "One Pot Pasta Primavera",
        "description": "This One Pot Pasta Primavera is the perfect balance of fresh and comforting! Made with colorful spring veggies, tender pasta, and creamy sauce, it comes together in just one pot for an easy, flavor-packed meal that the entire family will love!",
        "url": "https://www.eatfigsnotpigs.com/one-pot-pasta-primavera/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2025/05/One-Pot-Pasta-Primavera_0328-1024x683.jpg",
        "ingredients": [
            "2 tablespoons extra virgin olive oil",
            "1 small yellow onion, diced",
            "6 cloves fresh minced garlic",
            "12 ounces short pasta, such as cavatappi or penne",
            "3 ½ cups vegetable broth",
            "2 tablespoons nutritional yeast",
            "2 teaspoons garlic powder",
            "1 teaspoon Italian seasoning",
            "1 teaspoon kosher salt, plus more to taste",
            "1 teaspoon fresh cracked black pepper, plus more to taste",
            "1 teaspoon red chili flakes optional",
            "10 asparagus spears, trimmed and cut into 1”-inch pieces",
            "1 small zucchini, thinly sliced",
            "1 small yellow squash, thinly sliced",
            "1 carrot, cut into matchsticks",
            "1 cup cherry tomatoes, cut in half",
            "1 cup frozen green peas",
            "1 cup vegan heavy cream, at room temperature",
            "4 ounces baby spinach, about 4 cups",
            "½ cup vegan parmesan, plus more for garnish, optional",
            "5-6 fresh basil leaves, thinly sliced, plus more for garnish"
        ],
        "instructions": [
            "Heat the oil in a large Dutch oven or pot over medium heat.",
            "Once the oil hot, add the onion and sauté, stirring often, until translucent, 3 to 4 minutes.",
            "Add the garlic and sauté another 1 to 2 minutes.",
            "Next, add the pasta and pour in the broth.",
            "Season with the nutritional yeast, garlic powder, Italian seasoning, salt, pepper, and red chili flakes, stirring to combine.",
            "Increase the heat to high and bring to a boil.",
            "Once at a boil, reduce the heat to medium-low and continue to simmer, stirring occasionally, until the pasta is almost (but not quite) al dente, 5 to 8 minutes.",
            "Pour in the heavy cream and add the asparagus, zucchini, squash, carrots, tomatoes, and peas, mixing to combine.",
            "Cover and continue to cook until the pasta is tender, and the veggies are crisp-tender, 5 to 8 minutes.",
            "Mix in the spinach and continue to cook until it’s just wilted, 2 to 3 minutes.",
            "Once the spinach is wilted, add the parmesan, lemon juice and basil, and stir to combine.",
            "Serve immediately and garnish with vegan parmesan and fresh herbs. Enjoy!"
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "Italian Inspired",
            "Lunch",
            "Mains",
            "One and Done",
            "One-Pot + One-Skillet",
            "Pasta",
            "Quick and Easy",
            "Spring/Summer"
        ],
        "id": "10"
    },
    {
        "name": "Skillet Veggie Pesto Lasagna (Vegan)",
        "description": "Bright, creamy, and packed with fresh veggies, this Skillet Veggie Pesto Lasagna is a comforting meal that comes together in just one pan. With layers of broken lasagna noodles, tofu ricotta, and melty vegan mozzarella, it’s a weeknight dinner everyone will love!",
        "url": "https://www.eatfigsnotpigs.com/skillet-veggie-pesto-lasagna-vegan/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2025/04/Skillet-Veggie-Pesto-Lasagna_0314-1024x683.jpg",
        "ingredients": [
            "7 oz extra firm tofu, drained of excess liquid and crumbled",
            "2 tablespoons nutritional yeast",
            "1 TBS olive oil",
            "2 tsp apple cider vinegar",
            "1 tsp garlic powder",
            "1 tsp Italian seasoning",
            "½ tsp onion powder",
            "½ tsp kosher salt, plus more to taste",
            "1 tablespoon olive oil",
            "1 small yellow onion, diced",
            "1 small zucchini, thinly sliced",
            "6 cloves fresh minced garlic",
            "2 cups vegetable broth",
            "1 cup vegan heavy cream",
            "6 oz kale, stems removed and finely chopped",
            "1 cup finely chopped broccoli florets",
            "1 cup frozen peas",
            "1 teaspoon salt, plus more to taste",
            "1 teaspoon fresh cracked pepper, plus more to taste",
            "1 teaspoon garlic powder",
            "8 lasagna noodles",
            "½ cup vegan-friendly pesto, homemade or store-bought",
            "¾ cup vegan mozzarella shreds, room temperature",
            "Vegan shredded parmesan, for garnish, optional",
            "Fresh minced parsley, for garnish, optional"
        ],
        "instructions": [
            "To make the skillet lasagna, heat the olive oil in an large sauté pan over medium heat.",
            "Once the oil is hot, add the onion and zucchini and cook, stirring often, until the onion is translucent and the zucchini is tender, 4 to 5 minutes.",
            "Add the garlic and sauté another 1 to 2 minutes.",
            "Pour in the vegetable broth and cream, stirring to combine and scraping up any brown bits at the bottom of the pan.",
            "Season with the salt and pepper, then working in batches, add the kale, broccoli, and peas stirring to combine thoroughly.",
            "Bring to a simmer and cook until the spinach has just wilted, 3 to 5 minutes.",
            "Break up the lasagna noodles and gently stir them in, using a spatula to submerge the noodles into the liquid.",
            "Place a lid on the skillet and bring to a boil over medium-high heat.",
            "Once at a boil, remove the lid and give the mixture a quick mix.",
            "Replace the lid, reduce the heat to medium-low and simmer until the noodles are al dente, stirring every so often, 13 to 17 minutes.",
            "While the lasagna is simmering, quickly prepare the tofu ricotta.",
            "Pulse the ingredients for the tofu ricotta in a small food processor until smooth, 1-2 minutes.",
            "Taste and adjust seasonings if necessary and set aside.",
            "Once the lasagna noodles are tender, remove the lid, stir in the pesto until combined, and dollop the tofu ricotta on top.",
            "Sprinkle the mozzarella over the top, place the lid back on the skillet and simmer another 3 to 5 minutes, until the cheese melts – if you’d like, you can also pop in it under your oven broiler (make sure your pan is oven-safe) until the cheese is melty and the lasagna is slightly crisped around the edges.",
            "Remove the skillet form the heat and let it rest a few minutes before serving.",
            "Garnish with fresh minced parsley and enjoy!"
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "Italian Inspired",
            "Lunch",
            "Mains",
            "One and Done",
            "One-Pot + One-Skillet",
            "Pasta",
            "Quick and Easy",
            "Tofu"
        ],
        "id": "11"
    },
    {
        "name": "Cold Sesame Noodles",
        "description": "Cool, creamy, and packed with flavor, these Cold Sesame Noodles are the perfect no-fuss meal for hot days! Ready in under 20 minutes and endlessly customizable!",
        "url": "https://www.eatfigsnotpigs.com/cold-sesame-noodles/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2025/04/Cold-Sesame-Noodles_0287-1024x683.jpg",
        "ingredients": [
            "1- pound noodles (ramen, soba, and spaghetti work best)",
            "½ cup Chinese sesame paste or tahini",
            "6 cloves fresh minced garlic",
            "¼ cup soy sauce",
            "2 tablespoons toasted sesame oil",
            "2 tablespoons maple syrup",
            "2 tablespoons chili garlic sauce or sambal oelek",
            "2 tablespoons rice vinegar",
            "1 small cucumber, thinly sliced",
            "1 teaspoon salt, plus more to taste",
            "1 teaspoon chili flakes, optional",
            "Toasted sesame seeds. for garnish, optional"
        ],
        "instructions": [
            "Cook the noodles according to the package instructions.",
            "Drain and rinse under cold water and set aside.",
            "In large mixing bowl, whisk together the sesame paste, minced garlic, soy sauce, sesame oil, maple syrup, chili garlic sauce, and rice vinegar until smooth – add 1 tablespoon of water as needed to reach a thick, but pourable consistency.",
            "Add the noodles to the bowl and toss until they are coated in the sauce.",
            "Taste and adjust seasonings, if necessary.",
            "In a separate bowl, gently mix the cucumber, salt, and chili flakes until combined.",
            "Serve immediately and garnish cucumbers and toasted sesame seeds, and enjoy!"
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "Asian Inspired",
            "Lunch",
            "Mains",
            "Noodles",
            "Quick and Easy",
            "Spring/Summer"
        ],
        "id": "12"
    },
    {
        "name": "Street Corn Pasta Salad",
        "description": "If you love esquites and elote, then you have ty this street corn pasta salad! Loaded with roasted corn, jalapeño, vegan queso, and creamy dressing, this pasta salad is a fun and delicious twist on a classic and beloved street food!",
        "url": "https://www.eatfigsnotpigs.com/street-corn-pasta-salad/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2024/05/IMG_0014-1024x768.jpg",
        "ingredients": [
            "16 oz dried pasta",
            "1 cup vegan mayo",
            "½ cup vegan sour cream",
            "½ large lemon, juiced",
            "2 tsp ancho chili powder",
            "1 tsp ground cumin",
            "1 tsp garlic powder",
            "½ tsp kosher salt",
            "½ tsp cayenne powder, optional",
            "4 cups roasted corn",
            "6 oz vegan feta, plus more for garnish",
            "1 cup minced cilantro, plus more for garnish",
            "1 cup diced red onion",
            "2 large roasted jalapeños, diced"
        ],
        "instructions": [
            "Start by cooking the pasta according to the package instructions until it’s al dente. Once cooked, drain and rinse with cold water to stop the cooking process. Set aside.",
            "In a large bowl, whisk together the vegan mayo, vegan sour cream, lemon juice, ancho chili powder, ground cumin, garlic powder, salt and cayenne powder (if using). This will be the creamy base that ties all the flavors together.",
            "Add the cooked pasta, roasted corn, vegan feta, minced cilantro, diced red onion, and diced jalapeño to the bowl with the dressing. Toss everything together until the pasta is well coated and all ingredients are evenly distributed.",
            "For the best flavor, let the pasta salad chill in the refrigerator for at least one hour before serving. This allows the flavors to meld together beautifully.",
            "Garnish with more vegan feta and cilantro, and enjoy!"
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "4th of July",
            "Backyard BBQ",
            "Labor Day",
            "Memorial Day",
            "Pasta",
            "Quick and Easy",
            "Side Dishes",
            "Spring/Summer"
        ],
        "id": "13"
    },
    {
        "name": "Creamy One Pan Lemon Pepper Tofu and Orzo",
        "description": "Say hello to your new favorite weeknight dinner! This Creamy One Pan Lemon Pepper Tofu and Orzo is simple, satisfying, and full of bright, zesty flavors! Crispy tofu is paired with creamy orzo simmered in a garlicky lemon broth, then finished with mozzarella, spinach, and peas – perfect for spring or any time you’re craving something creamy yet still bright and fresh!",
        "url": "https://www.eatfigsnotpigs.com/creamy-one-pan-lemon-pepper-tofu-and-orzo/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2025/04/Creamy-One-Pan-Lemon-Pepper-Tofu-and-Orzo_0279-1024x683.jpg",
        "ingredients": [
            "1 16-ounce block of super firm tofu, cubed (or extra firm tofu, pressed, drained, and cubed)",
            "2 tablespoons cornstarch",
            "2 tablespoons salt-free lemon pepper seasoning divided",
            "1 ½ teaspoons kosher salt divided, plus more to taste",
            "1 teaspoon garlic powder",
            "1 teaspoon red chili flakes optional, divided",
            "3 tablespoons olive oil divided",
            "1 small yellow onion diced",
            "6 cloves fresh minced garlic",
            "1 ½ cups uncooked orzo",
            "4 cups vegetable broth",
            "Zest of half a lemon plus the juice, divided",
            "6 cups baby spinach about 6 ounces",
            "1 cup peas",
            "1 cup vegan mozzarella shreds room temperature",
            "Vegan parmesan for garnish, optional",
            "Fresh chopped parsley for garnish, optional"
        ],
        "instructions": [
            "To prepare the tofu, toss the tofu cubes with cornstarch, 1 tablespoon lemon pepper seasoning, 1 teaspoon salt, garlic powder, and ½ teaspoon chili flakes (if using).",
            "Heat 2 tablespoons of the olive oil in a large sauté pan over medium heat and pan-fry the tofu until golden brown and crispy, about 8 to 10 minutes.",
            "Remove and set aside.",
            "Heat the remaining tablespoon of olive oil in the pan over medium heat.",
            "Once hot, add the onions.",
            "Cook, stirring often, until the onion is translucent, 5 to 6 minutes.",
            "Add the garlic and cook until fragrant, 1 to 2 minutes.",
            "Next, add the orzo.",
            "Season with the remaining tablespoon of lemon pepper seasoning, ½ teaspoon red chili flakes, ½ teaspoon salt and lemon zest.",
            "Stir to combine and pour in the broth.",
            "Increase the heat to high.",
            "Once at a light boil, reduce the heat to medium, and simmer, stirring every few minutes, until the orzo is cooked through and the mixture has thickened, 15 to 20 minutes.",
            "Reduce the heat to low and mix in the spinach and peas, stirring to combine, until the spinach is lightly wilted, 2 to 3 minutes.",
            "Next, stir in the mozzarella shreds and reserved tofu.",
            "Continue to stir until the cheese has melted throughout and everything is thoroughly combined.",
            "Add the lemon juice, give it a good mix, then taste and adjust seasonings if necessary.",
            "Garnish with a sprinkle of parmesan and fresh minced parsley, and enjoy!"
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "Italian Inspired",
            "Lunch",
            "Mains",
            "Mother's Day",
            "One and Done",
            "One-Pot + One-Skillet",
            "Pasta",
            "Quick and Easy",
            "Spring/Summer",
            "Tofu"
        ],
        "id": "14"
    },
    {
        "name": "Crispy Buffalo Chicken Salad (Vegan)",
        "description": "This Crispy Buffalo Chicken Salad is tossed with fresh lettuce, crisp veggies, homemade buffalo chicken soy curls, and a creamy dill ranch dressing! The perfect summer salad!",
        "url": "https://www.eatfigsnotpigs.com/crispy-buffalo-chicken-salad-vegan/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2024/04/Crispy-Buffalo-Chicken-Salad_0065-1024x683.jpg",
        "ingredients": [
            "2 cups dried soy curls",
            "1 cup vegetable broth",
            "2 tablespoons buffalo sauce",
            "1 teaspoon smoked paprika",
            "1 teaspoon garlic powder",
            "1 teaspoon onion powder",
            "1 teaspoon salt",
            "1 teaspoon pepper",
            "1/3 cup all-purpose flour",
            "1 cup vegetable oil for frying",
            "¼ cup vegan mayonnaise",
            "2 tablespoons unflavored and unsweetened non-dairy milk",
            "1 tsp apple cider vinegar",
            "½ tsp dried dill weed",
            "¼ tsp garlic powder",
            "¼ tsp Kosher Salt",
            "¼ Fresh cracked black pepper",
            "4 cups chopped romaine",
            "1 cucumber, peeled and diced",
            "2 carrots, grated or peeled into ribbons",
            "½ red onion, thinly sliced",
            "1 cup cherry tomatoes, halved",
            "½ cup buffalo sauce"
        ],
        "instructions": [
            "For the crispy fried soy curls, soak the dried soy curls in vegetable broth or water for about 10-15 minutes until they are rehydrated. In another bowl, mix buffalo sauce, smoked paprika, garlic powder, onion powder, salt, and pepper.",
            "Drain the rehydrated soy curls and squeeze out excess moisture. Toss them in the spice mixture until well coated. Sprinkle in the flour and toss once more until thoroughly coated.",
            "Heat vegetable oil in a deep skillet or pot over medium heat.",
            "Meanwhile, place the flour in a shallow dish. Dredge the seasoned soy curls in the flour, shaking off any excess.",
            "Fry the soy curls in batches until crispy and golden brown, about 3-4 minutes per batch. Transfer to a plate lined with paper towels to drain excess oil.",
            "For the dressing, combine all its ingredients in a bowl and whisk well to combine. Taste and adjust seasonings. Set aside in the refrigerator.",
            "Place all the salad ingredients besides the ½ cup buffalo sauce in a large bowl. In a separate bowl, toss the crispy fried soy curls in the buffalo sauce until coated. Add them to the salad, then add 3/4 of the dressing and toss until everything is evenly coated.",
            "Divide the Vegan Buffalo Chicken Salad into individual serving bowls and drizzle each salad with the remaining dressing. Serve immediately and enjoy!"
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "Backyard BBQ",
            "Labor Day",
            "Lunch",
            "Memorial Day",
            "Quick and Easy",
            "Salads",
            "Salads That Don’t Suck",
            "Spring/Summer"
        ],
        "id": "15"
    },
    {
        "name": "Creamy Zucchini Pasta",
        "description": "This Creamy Zucchini Pasta is great way to use up your yearly surplus of summertime squash! Quick, easy, cost-effective, and best of all, DELICIOUS, this recipe checks all the boxes for the perfect summer meal!",
        "url": "https://www.eatfigsnotpigs.com/creamy-zucchini-pasta/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2022/07/Creamy-Zucchini-Pasta_1363-768x1024.jpg",
        "ingredients": [
            "1- pound uncooked pasta",
            "3 tablespoons olive oil",
            "4 cups zucchini, roughly chopped (about 2 to 3 medium zucchini)",
            "2 shallots, diced",
            "4 cloves garlic, minced",
            "1 teaspoon kosher salt, plus more to taste",
            "1 teaspoon fresh cracked black pepper, plus more to taste",
            "2 cups loosely packed basil, (about 30 grams), plus more for garnish",
            "1 cup plant-based heavy cream or unsweetened and unflavored extra creamy non-dairy milk",
            "½ cup nutritional yeast",
            "2 vegetable bouillon cubes or 2 teaspoons vegetable bouillon paste",
            "Vegan parmesan, for garnish, optional",
            "Lemony Pistachio Breadcrumbs for garnish, optional (recipe below)",
            "½ cup pistachio kernels",
            "Zest of 1 small lemon ",
            "1 tablespoon olive oil",
            "½ cup panko breadcrumbs",
            "1 tablespoon nutritional yeast",
            "½ teaspoon garlic powder"
        ],
        "instructions": [
            "Cook the pasta in a large pot of salted water until al dente, according to package directions. Before draining, reserve ½ cup of the starchy pasta water. Drain, but do not rinse.",
            "1Meanwhile, heat the oil in a large sauté pan over medium heat. Once the oil is hot, add the zucchini, shallot and garlic, and season with the salt and pepper. Cook, stirring often, until the zucchini is tender, 12 to 15 minutes. Remove from the heat and let it cool at room temperature for 5 to 10 minutes.",
            "Transfer the zucchini mixture to a high-powered blender with the reserved pasta water, basil, heavy cream, nutritional yeast and bouillon cubes. Pulse until smooth. Taste and adjust seasonings if necessary.",
            "Toss the sauce with the pasta until coated. Serve with vegan parmesan, fresh basil, and pistachio breadcrumbs (optional) and enjoy!",
            "For the breadcrumbs, place the pistachio kernels and the zest in a food processor, and pulse until a crumb forms. Heat the olive oil in a small nonstick pan over medium heat. Once the oil I s hot, add the pistachio crumbs, panko breadcrumbs, nutritional yeast, and garlic powder. Mix to thoroughly combine and cook, tossing often, until the breadcrumb mixture turns golden-brown, 5 to 7 minutes."
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "Italian Inspired",
            "Lunch",
            "Mains",
            "Pasta",
            "Quick and Easy",
            "Spring/Summer"
        ],
        "id": "16"
    },
    {
        "name": "Sweet and Sour Tofu",
        "description": "Inspired by a classic takeout favorite, this sweet and sour tofu has crispy tofu pieces, pineapples, bell peppers, and onions swimming in a delicious sweet and savory sauce. Serve over white rice for a meal that everyone will love!",
        "url": "https://www.eatfigsnotpigs.com/sweet-and-sour-tofu/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2022/09/IMG_1564-1-1024x683.jpg",
        "ingredients": [
            "1 16-ounce block extra-firm tofu, drained and pressed for 20 minutes",
            "4 tablespoons cornstarch, divided",
            "2 teaspoons kosher salt, divided",
            "1 teaspoon fresh cracked black pepper",
            "3 tablespoons vegetable oil",
            "½ cup vinegar",
            "½ cup water",
            "⅓ cup ketchup",
            "¼ cup granulated sugar",
            "¼ cup pineapple juice (from the can of pineapple chunks)",
            "1 teaspoon red pepper flakes, optional",
            "6 ounces canned pineapple chunks, drained (reserve ¼ cup of the pineapple juice)",
            "1 small white onion, chopped",
            "1 small red bell pepper, chopped",
            "1 small green bell pepper, chopped",
            "1 jalapeño, deseeded, deveined, and diced (optional)",
            "8 cloves fresh minced garlic",
            "White rice, for serving",
            "Toasted sesame seeds for garnish, optional",
            "Sliced green onion for garnish, optional"
        ],
        "instructions": [
            "Tear the tofu into ½ – inch bite-size pieces and place them into a shallow bowl.",
            "Sprinkle 2 tablespoons of cornstarch and 1 teaspoon of salt onto the tofu pieces and toss to combine, ensuring each piece is coated.",
            "Heat the oil in a large wok or sauté pan over medium-high heat.",
            "Once the oil is hot, add the tofu pieces and cook, tossing occasionally, until the tofu turns golden-brown and crispy, 6 to 8 minutes.",
            "Using a slotted spoon, remove the crispy tofu from the wok and transfer to a paper-towel lined plate and set aside.",
            "Meanwhile, pour the vinegar, water, ketchup, sugar, pineapple juice, red pepper flakes, remaining teaspoon salt and tablespoon of cornstarch in a bowl and whisk to combine. Set aside.",
            "Over medium-high heat, in the same wok that you cooked the tofu, add the pineapple, onion, bell peppers and jalapeño.",
            "Cook, stirring often, until the onions are translucent, and the bell peppers are slightly softened, 4 to 5 minutes.",
            "Add the garlic, and cook until fragrant, another 1 to 2 minutes.",
            "Pour in the reserved sweet and sour sauce and simmer until the sauce thickens and reduces by about a third, 5 to 6 minutes.",
            "Mix in the crispy tofu and to toss combine until heated through and thoroughly coated in the sauce, 2 to 3 minutes.",
            "Serve immediately over white and garnish with sesame seeds and green onions and enjoy!"
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "Asian Inspired",
            "Mains",
            "Quick and Easy",
            "Restaurant Remakes",
            "Tofu"
        ],
        "id": "17"
    },
    {
        "name": "Southwest Chick’n and Quinoa Skillet",
        "description": "This delicious and easy Southwest Chick’n and Rice Skillet is a one-pan meal that’s perfect for weeknights and meal-prep! Protein-packed seasoned soy curls, fluffy rice, sweet corn, hearty black beans, and creamy avocado come together for a recipe that’s not only bursting with flavor, but also nutritious! A win-win!",
        "url": "https://www.eatfigsnotpigs.com/southwest-chickn-and-quinoa-skillet/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2025/03/Southwest-Chickn-and-Quinoa-Skillet_0277-1024x683.jpg",
        "ingredients": [
            "2 teaspoons chili powder",
            "1 teaspoon kosher salt",
            "1 teaspoon garlic powder",
            "1 teaspoon onion powder",
            "1 teaspoon smoked paprika",
            "1 teaspoon ground cumin",
            "½ teaspoon cayenne pepper",
            "4 ounces dehydrated soy curls (about 2 cups)",
            "2 tablespoons extra-virgin olive oil, divided",
            "1 teaspoon poultry seasoning",
            "1 cup diced red onion (about 1 small onion)",
            "1 cup diced red bell peppers (about 1 pepper)",
            "¾ cup diced poblano peppers (about 1 pepper)",
            "1/3 cup deseeded, deveined, and minced jalapeño pepper (about 1 large jalapeño)",
            "6 cloves fresh minced garlic",
            "1 cup uncooked quinoa, rinsed",
            "1 14.5-ounce can fire-roasted tomatoes, with juice",
            "1 15-ounce can black beans, drained and rinsed",
            "1 15-ounce can corn, drained and rinsed",
            "½ cup fresh chopped cilantro, plus more for garnish",
            "1 ½ cups vegetable broth",
            "½ cup tomato sauce",
            "¼ cup fresh lime juice (about 2 limes)",
            "1 cup vegan cheddar shreds",
            "Thinly sliced avocado",
            "Hot sauce of choice"
        ],
        "instructions": [
            "To make the seasoning mix, combine all the ingredients in a small bowl and set aside.",
            "Soak the soy curls in hot water for 8 to 10 minutes.",
            "After the soy curls have soaked, drain and squeeze out the excess water through a fine-mesh sieve or cheesecloth.",
            "Next, heat 1 tablespoon of the oil in a large skillet over medium-high heat.",
            "Once the oil is hot, add the soy curls and poultry seasoning and cook, stirring occasionally, until the soy curls start to crisp on the edges, 8 to 10 minutes.",
            "Transfer the soy curls to a plate and set aside.",
            "In the same skillet, heat the remaining tablespoon of oil over medium heat.",
            "Once the oil is hot, add the onions, peppers, and cook, stirring occasionally, until the onions are translucent, 3 to 5 minutes.",
            "Add the garlic and sauté another 1 to 2 minutes.",
            "Next, pour in the quinoa, diced tomatoes with their juice, beans, corn, and cilantro, and mix well.",
            "Pour in the broth, seasoning mix, tomato sauce, and lime juice and stir gently.",
            "Increase the heat to high and bring the mixture to a boil.",
            "Once at a simmer, reduce the heat to low, cover, and simmer until the quinoa has absorbed all the liquid, 20 to 25 minutes, stirring occasionally.",
            "Stir in the reserved soy curls until combined",
            "Remove the lid and fluff the quinoa with a fork.",
            "Sprinkle the cheddar shreds evenly over the mixture, cover, and let the residual heat melt the cheese, about 5 minutes.",
            "Garnish with cilantro and serve warm with avocado wedges and your favorite hot sauce. Enjoy!"
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "Lunch",
            "Mains",
            "Mexican Inspired",
            "One-Pot + One-Skillet",
            "Quick and Easy",
            "Tex-Mex"
        ],
        "id": "18"
    },
    {
        "name": "Crispy Parmesan Crusted Eggplant with Arugula",
        "description": "This Crispy Parmesan Crusted Eggplant with Arugula is my vegan take on chicken Milanese.Dre Thinly sliced eggplant is coated in breadcrumbs and vegan parmesan, then fried to golden, crisp perfection. Served with marinara sauce, then topped with a simple arugula salad tossed in herby dressing, this dish is both fresh and vibrant, yet rich and savory!",
        "url": "https://www.eatfigsnotpigs.com/crispy-parmesan-crusted-eggplant-with-arugula/",
        "img": "https://www.eatfigsnotpigs.com/wp-content/uploads/2022/12/IMG_1824-2-1024x768.jpg",
        "ingredients": [
            "1 large eggplant cut lengthwise into ½-inch thick slices",
            "4 teaspoons kosher salt divided, plus more to taste",
            "½ cup all-purpose flour",
            "1 teaspoon fresh cracked black pepper plus more to taste",
            "½ – 1 cup unsweetened and unflavored nondairy milk",
            "1 – 1 ½ cups vegan-friendly Italian-style panko breadcrumbs",
            "1 cup vegan parmesan shreds finely minced or quickly pulsed in a food processor, plus more for garnish",
            "1 cup canola oil for frying",
            "5 ounces baby arugula",
            "2-3 tablespoons French vinaigrette dressing, or dressing of choice, homemade or store-bought",
            "2-3 tablespoons garlicky pistachio breadcrumbs, optional",
            "Warmed marinara sauce homemade or store-bought, for serving",
            "Fresh lemon wedges for serving"
        ],
        "instructions": [
            "Arrange the eggplant on a large wire rack or baking tray and sprinkle the slices generously with 3 teaspoons of salt.",
            " Let sit for 20 to 30 minutes – you’ll notice the eggplant will release moisture. Rinse and pat dry.",
            "Set up a dredging station with three shallow bowls. ",
            "Whisk together the flour, remaining teaspoon of salt, and pepper in one bowl.",
            "In the second bowl, pour in the milk. ",
            "In the third bowl, mix the breadcrumbs and vegan parmesan together until thoroughly combined.",
            "Coat each eggplant slice, turning and shaking off any excess, first into the flour, then into the milk, then into the parmesan breadcrumbs, ensuring the eggplant is coated during each step of the process.",
            "Heat the oil in a large sauté pan over medium heat – the oil should be about ½ – inch deep. ",
            "Working in batches, fry the eggplant until golden and crispy, 2 to 4 minutes per side.",
            "Transfer to a wire rack or paper-towel lined plate and repeat with the remaining slices.",
            "Add the arugula to a large bowl and toss with the dressing and breadcrumbs until coated.",
            "To serve, spoon some marinara sauce on the bottom of a plate. ",
            "Arrange a couple of slices of the eggplant on top of the marinara, then top the eggplant with some arugula and a sprinkle of vegan parmesan.",
            "Serve with fresh lemon wedges, and enjoy!"
        ],
        "categories": [
            "(Can Be Made) Gluten-Free",
            "Christmas",
            "Fall/Winter",
            "Holiday",
            "Italian Inspired",
            "Lunch",
            "Mains"
        ],
        "id": "19"
    }
]